IDENTIFICATION DIVISION.
PROGRAM-ID. test.
ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT STANDARD-INPUT ASSIGN TO KEYBOARD.
    SELECT STANDARD-OUTPUT ASSIGN TO DISPLAY.
    SELECT INPUT-FILE
   ASSIGN TO INPUT-FILE-NAME
   ORGANIZATION IS LINE SEQUENTIAL.
DATA DIVISION.
FILE SECTION.
FD STANDARD-INPUT.
    01 STDIN-RECORD   PICTURE X(80).
FD STANDARD-OUTPUT.
    01 STDOUT-RECORD  PICTURE X(80).
FD  INPUT-FILE.
01  INPUT-RECORD PIC X(20).
WORKING-STORAGE SECTION.
01 WS-EOF PIC A(1).
77 GET-LINE	PIC X(30) VALUE " ". 
77 IN-LINE	PIC X(30).
01 FORMATTED-INTEGER	PIC Z(04)9.
77 SUMM PIC 9(10).
77 ISFILE PIC 9(1) VALUE 0.
77 GOOD PIC 9(1) VALUE 0.
01 PREV PIC X(1).
77 I    PICTURE S99 USAGE IS COMPUTATIONAL.
01 W-SUB               PIC 9(2) VALUE 0.              
01 S-ALPHABET-FOUND    PIC X(1) VALUE 'N'.   
01 INPUT-FILE-NAME PIC X(64) VALUE ' '.
	  
PROCEDURE DIVISION.

OPEN INPUT STANDARD-INPUT, OUTPUT STANDARD-OUTPUT
	DISPLAY " "
	DISPLAY "Enter a filename with a '.' and it will read the file"
	END-PERFORM.